import React from "react";
import styled from "styled-components";

const ReviewModalSection = styled.div`
	display: flex;
	justify-content: space-between;
	padding: 1rem;

	img {
		width: 50%;
	}
`;

const ReviewModalWrite = styled.div`
	display: flex;
	flex-direction: column;
	width: 50%;
	margin-left: 1rem;
	color: #ffffe7;
`;

const ReviewModal = ({ data }) => {
	return (
		<ReviewModalSection>
			<img src={data} alt="img" />
			<ReviewModalWrite>
				대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰대충
				리뷰대충 리뷰대충 리뷰대충 리뷰대충 리뷰
			</ReviewModalWrite>
		</ReviewModalSection>
	);
};

export default ReviewModal;
